[AHWStainlessSpark X2SparkArmorTemplate_DLC_3]
FriendlyName="<font color='#df07b7'>Gat'Dam Stainless Chassis</font>"
FriendlyNamePlural="<font color='#df07b7'>Gat'Dam Stainless Chassis</font>"
BriefSummary="This Unique Chassis is a massive improvement on the majority of our Mechanized Combat Armor designs, utilizing the unique structural components of a Mechtoid Chassis, and further reinforcing them with additional Alien Alloys, this will allow our Mechanized Units unparalled staying power in the field."
TacticalText="<Bullet/> Equipped Units gain 10% Damage Resistance to all Non-Electrical or Psionic Damage for every 10% Missing Health.\n<Bullet/> Massively reduces the chances of receiving a Critical Hit. \n<Bullet/> Provides Protection against Requiem Corrosion.\n <Bullet/>Reduces Nightmare Detonation Damage by 40%."
